#pragma once
#include <wut.h>
#include <vpadbase/base.h>

/**
 * \defgroup nfc_nfc
 * \ingroup nfc
 * Near Field Communication (NFC).
 * @{
 */

#ifdef __cplusplus
extern "C" {
#endif

typedef int32_t NFCError;
typedef uint8_t NFCProtocol;
typedef uint8_t NFCTechnology;
typedef uint8_t NFCTechnologyMask;
typedef uint8_t NFCNDEFFlags;
typedef struct NFCUid NFCUid;
typedef struct NFCTagInfo NFCTagInfo;
typedef struct NFCNTAGVersion NFCNTAGVersion;
typedef struct NFCReadT2TResult NFCReadT2TResult;

typedef enum NFCMode
{
   NFC_MODE_INVALID     = -1,
   //! NFC is idle
   NFC_MODE_IDLE        = 0,
   //! NFC is discovering / has an active tag
   NFC_MODE_ACTIVE      = 1,
} NFCMode;

typedef enum NFCProtocolEnum
{
   NFC_PROTOCOL_UNKNOWN         = 0x00,
   NFC_PROTOCOL_T1T             = 0x01,
   NFC_PROTOCOL_T2T             = 0x02,
   NFC_PROTOCOL_T3T             = 0x03,
   NFC_PROTOCOL_ISO_DEP         = 0x04,
   NFC_PROTOCOL_15693           = 0x83,
} NFCProtocolEnum;

typedef enum NFCTechnologyEnum
{
   NFC_TECHNOLOGY_A             = 0x00,
   NFC_TECHNOLOGY_B             = 0x01,
   NFC_TECHNOLOGY_F             = 0x02,
   NFC_TECHNOLOGY_ISO15693      = 0x06,
} NFCTechnologyEnum;

typedef enum NFCTechnologyMaskEnum
{
   NFC_TECHNOLOGY_MASK_ALL      = 0,
   NFC_TECHNOLOGY_MASK_A        = (1 << 0),
   NFC_TECHNOLOGY_MASK_B        = (1 << 1),
   NFC_TECHNOLOGY_MASK_F        = (1 << 2),
   NFC_TECHNOLOGY_MASK_ISO15693 = (1 << 3),
} NFCTechnologyMaskEnum;

typedef enum NFCNDEFFlagsEnum
{
   //! Tag is read only
   NFC_NDEF_FLAG_READ_ONLY     = (1 << 0),
   //! Tag formated for NDEF
   NFC_NDEF_FLAG_FORMATED      = (1 << 1),
   //! NDEF supported by the tag
   NFC_NDEF_FLAG_SUPPORTED     = (1 << 2),
   //! Unable to find if tag is ndef capable/formated/read only
   NFC_NDEF_FLAG_UNKNOWN       = (1 << 3),
   //! Tag supports format operation
   NFC_NDEF_FLAG_FORMATABLE    = (1 << 4),
   //! Tag can be soft locked
   NFC_NDEF_FLAG_SOFT_LOCKABLE = (1 << 5),
   //! Tag can be hard locked
   NFC_NDEF_FLAG_HARD_LOCKABLE = (1 << 6),
   //! Tag is one time programmable
   NFC_NDEF_FLAG_OTP           = (1 << 7),
} NFCNDEFFlagsEnum;

struct NFCUid
{
   uint8_t uid[7];
};
WUT_CHECK_OFFSET(NFCUid, 0x00, uid);
WUT_CHECK_SIZE(NFCUid, 0x07);

struct NFCTagInfo
{
   uint8_t uidSize;
   uint8_t uid[10];
   NFCTechnology technology;
   NFCProtocol protocol;
   WUT_PADDING_BYTES(0x20); // reserved
};
WUT_CHECK_OFFSET(NFCTagInfo, 0x00, uidSize);
WUT_CHECK_OFFSET(NFCTagInfo, 0x01, uid);
WUT_CHECK_OFFSET(NFCTagInfo, 0x0B, technology);
WUT_CHECK_OFFSET(NFCTagInfo, 0x0C, protocol);
WUT_CHECK_SIZE(NFCTagInfo, 0x2D);

// GET_VERSION response for NTAG213, NTAG215 and NTAG216
struct NFCNTAGVersion
{
   uint8_t header;
   uint8_t vendorId;
   uint8_t productType;
   uint8_t productSubtype;
   uint8_t majorProductVersion;
   uint8_t minorProductversion;
   uint8_t storageSize;
   uint8_t protocolType;
};
WUT_CHECK_OFFSET(NFCNTAGVersion, 0x00, header);
WUT_CHECK_OFFSET(NFCNTAGVersion, 0x01, vendorId);
WUT_CHECK_OFFSET(NFCNTAGVersion, 0x02, productType);
WUT_CHECK_OFFSET(NFCNTAGVersion, 0x03, productSubtype);
WUT_CHECK_OFFSET(NFCNTAGVersion, 0x04, majorProductVersion);
WUT_CHECK_OFFSET(NFCNTAGVersion, 0x05, minorProductversion);
WUT_CHECK_OFFSET(NFCNTAGVersion, 0x06, storageSize);
WUT_CHECK_OFFSET(NFCNTAGVersion, 0x07, protocolType);
WUT_CHECK_SIZE(NFCNTAGVersion, 0x08);

struct NFCReadT2TResult
{
   //! The amount of reads which have been performed
   uint8_t numReads;
   uint8_t read0Start;
   uint8_t read0End;
   uint8_t read1Start;
   uint8_t read1End;
   uint8_t read2Start;
   uint8_t read2End;
   uint8_t read3Start;
   uint8_t read3End;
   //! The data which has been read
   uint8_t data[0x3A0];
};
WUT_CHECK_OFFSET(NFCReadT2TResult, 0x00, numReads);
WUT_CHECK_OFFSET(NFCReadT2TResult, 0x01, read0Start);
WUT_CHECK_OFFSET(NFCReadT2TResult, 0x02, read0End);
WUT_CHECK_OFFSET(NFCReadT2TResult, 0x03, read1Start);
WUT_CHECK_OFFSET(NFCReadT2TResult, 0x04, read1End);
WUT_CHECK_OFFSET(NFCReadT2TResult, 0x05, read2Start);
WUT_CHECK_OFFSET(NFCReadT2TResult, 0x06, read2End);
WUT_CHECK_OFFSET(NFCReadT2TResult, 0x07, read3Start);
WUT_CHECK_OFFSET(NFCReadT2TResult, 0x08, read3End);
WUT_CHECK_OFFSET(NFCReadT2TResult, 0x09, data);
WUT_CHECK_SIZE(NFCReadT2TResult, 0x3A9);

/**
 * Generic callback function.
 * 
 * \param chan
 * The channel this callback is coming from.
 * 
 * \param error
 * 0 on success.
 * 
 * \param userContext
 * User provided value.
 */
typedef void
(*NFCCallbackFn)(VPADChan chan,
                 NFCError error,
                 void *userContext);

/**
 * Callback function for \link NFCSetTagDetectCallback \endlink.
 * 
 * \param chan
 * The channel this callback is coming from.
 * 
 * \param hasTag
 * \c TRUE if a tag has been attached. \c FALSE if a tag has been removed.
 * 
 * \param userContext
 * User provided value.
 */
typedef void
(*NFCTagDetectCallbackFn)(VPADChan chan,
                          BOOL hasTag,
                          void *userContext);

/**
 * Callback function for \link NFCDetect \endlink.
 * 
 * \param chan
 * The channel this callback is coming from.
 * 
 * \param error
 * 0 on success.
 * 
 * \param uid
 * The UID of the tag.
 * 
 * \param readOnly
